flipperdevices/flipperzero-firmware/applications/external/base_pack/dap_link/lib/free-dap/platform/same70/include/same70.h
/**
 * \file
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */
#ifndef _SAME70_
#define _SAME70_

#if defined (__SAME70J19__)
#include "same70j19.h"
#elif defined (__SAME70J20__)
#include "same70j20.h"
#elif defined (__SAME70J21__)
#include "same70j21.h"
#elif defined (__SAME70N19__)
#include "same70n19.h"
#elif defined (__SAME70N20__)
#include "same70n20.h"
#elif defined (__SAME70N21__)
#include "same70n21.h"
#elif defined (__SAME70Q19__)
#include "same70q19.h"
#elif defined (__SAME70Q20__)
#include "same70q20.h"
#elif defined (__SAME70Q21__)
#include "same70q21.h"
#elif defined (__SAME70J19B__)
#include "same70j19b.h"
#elif defined (__SAME70J20B__)
#include "same70j20b.h"
#elif defined (__SAME70J21B__)
#include "same70j21b.h"
#elif defined (__SAME70N19B__)
#include "same70n19b.h"
#elif defined (__SAME70N20B__)
#include "same70n20b.h"
#elif defined (__SAME70N21B__)
#include "same70n21b.h"
#elif defined (__SAME70Q19B__)
#include "same70q19b.h"
#elif defined (__SAME70Q20B__)
#include "same70q20b.h"
#elif defined (__SAME70Q21B__)
#include "same70q21b.h"
#else
  #error Library does not support the specified device.
#endif

#endif /* _SAME70_ */
